Конфигурация отчетов/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПринадлежность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Склады/Ext/ManagerModule.bsl
Функция ПолучитьСклад(Заведение, ТипСклада) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Заведение КАК Заведение,
		|	Склады.Ссылка КАК Ссылка,
		|	Склады.СкладПринадлежность КАК СкладПринадлежность
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Заведение = &Заведение
		|	И Склады.СкладПринадлежность = &СкладПринадлежность";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("СкладПринадлежность", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
		
	Возврат Выборка.Ссылка;	
	
КонецФункции
